app/Models/VacanciesModel.php

    public function listVacancies()
    {
		$db      = \Config\Database::connect();

		$builder = $db->table('vacancy');

		$builder->select('*');
		$builder->join('company', 'vacancy.company_ID=company.ID');
		$builder->limit(10);
		$query = $builder->get();
---
SELECT *
FROM `vacancy`
JOIN `company` ON `vacancy`.`company_ID`=`company`.`ID`
 LIMIT 10

	public function getVacancyDetail($vacancy){
		$db      = \Config\Database::connect();

		$builder = $db->table('vacancy');

		$builder->select('*');
		$builder->join('company', 'vacancy.company_ID=company.ID');
		$query = $builder->getWhere(['vacancy.ID' => $vacancy]);
---
SELECT *
FROM `vacancy`
JOIN `company` ON `vacancy`.`company_ID`=`company`.`ID`
WHERE `vacancy`.`ID` = '1'

	public function getSimilar($vacancy){
		$db      = \Config\Database::connect();

		$builder = $db->table('vacancy');

		$builder->select('area');
		$query = $builder->getWhere(['vacancy.ID' => $vacancy]);
		$result = $query->getResult();
		$area = $result[0];
		$areaOG = $area->area;

		$builder->select('*');
		$builder->join('company', 'vacancy.company_ID=company.ID');
		$builder->limit(5);
		$builder->where('vacancy.ID !=', $vacancy);
		$query = $builder->getWhere(['vacancy.area' => $areaOG]);
---
SELECT `area`
FROM `vacancy`
WHERE `vacancy`.`ID` = '1'
SELECT *
FROM `vacancy`
JOIN `company` ON `vacancy`.`company_ID`=`company`.`ID`
WHERE `vacancy`.`ID` != '1'
AND `vacancy`.`area` = 'IT & Cybersecurity'
 LIMIT 5